QHD_wave-attractor/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     4.1;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoQGDThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.6; //this could be any value
    }

    equationOfState
    {
        rho    1000;
    }
    thermodynamics
    {
        Hf              0;
        Cp              4300;
    }

    transport
    {
        mu   0.001;
        Pr   700;
        beta -1; //2.0e-4;
    }
}

QGD
{
    pRefCell    0;
    pRefValue   0;
    implicitDiffusion true;
    QGDCoeffs constTau;
    constTauDict
    {
       Tau  0.002;//0.002
    }
}
